app/controllers/reporte_general_controller.rb

DELETE FROM "reporte_generals" WHERE "reporte_generals"."id" = $1  [["id", 980190962]]
---
  def destroy
    @reporte_general.destroy

SELECT "reporte_generals".* FROM "reporte_generals" WHERE "reporte_generals"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_reporte_general
      @reporte_general = ReporteGeneral.find(params[:id])