app/controllers/reportes_controller.rb

SELECT "reportes".* FROM "reportes"
---
  def index
    @reportes = Reporte.all  # Fetch all reportes from the database

INSERT INTO "reportes" ("sucursal", "logrado", "comentario", "created_at", "updated_at", "venta", "atencion", "producto", "instalaciones") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @reporte = Reporte.new(reporte_params)

    if @reporte.save

SELECT "reportes".* FROM "reportes" WHERE "reportes"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def show
    @reporte = Reporte.find(params[:id])

SELECT "reportes".* FROM "reportes" WHERE "reportes"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def set_reporte
    @reporte = Reporte.find(params[:id])